bench/results/sharegpt_1.5b_fp16_3090_r16.log
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/tmp/sharegpt.json', speed_bench_category=None, speed_bench_output_len=512, model='/models/rwkv7-1.5b-fla', served_model_name=None, tokenizer='/models/rwkv7-1.5b-fla', num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=16.0, use_trace_timestamps=False, max_concurrency=None, output_file='/tmp/sharegpt_1.5b_fp16_3090_r16.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://0.0.0.0:30000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/tmp/sharegpt.json', speed_bench_category=None, speed_bench_output_len=512, model='/models/rwkv7-1.5b-fla', served_model_name=None, tokenizer='/models/rwkv7-1.5b-fla', num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=16.0, use_trace_timestamps=False, max_concurrency=None, output_file='/tmp/sharegpt_1.5b_fp16_3090_r16.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 161035
#Output tokens: 98420
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 500/500 [00:50<00:00,  9.85it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    16.0      
Max request concurrency:                 not set   
Successful requests:                     500       
Benchmark duration (s):                  50.76     
Total input tokens:                      161035    
Total input text tokens:                 161035    
Total generated tokens:                  98420     
Total generated tokens (retokenized):    98023     
Request throughput (req/s):              9.85      
Input token throughput (tok/s):          3172.61   
Output token throughput (tok/s):         1939.01   
Peak output token throughput (tok/s):    8781.00   
Peak concurrent requests:                312       
Total token throughput (tok/s):          5111.63   
Concurrency:                             143.49    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   14566.82  
Median E2E Latency (ms):                 11092.28  
P90 E2E Latency (ms):                    32819.04  
P95 E2E Latency (ms):                    36850.09  
P99 E2E Latency (ms):                    42054.63  
---------------Time to First Token----------------
Mean TTFT (ms):                          474.76    
Median TTFT (ms):                        315.64    
P90 TTFT (ms):                           695.97    
P95 TTFT (ms):                           1653.44   
P99 TTFT (ms):                           3412.84   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          149.84    
Median TPOT (ms):                        98.21     
P90 TPOT (ms):                           332.41    
P95 TPOT (ms):                           464.15    
P99 TPOT (ms):                           755.74    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           72.00     
Median ITL (ms):                         20.42     
P90 ITL (ms):                            56.45     
P95 ITL (ms):                            146.03    
P99 ITL (ms):                            1745.49   
Max ITL (ms):                            5732.55   
==================================================