bench/results/sharegpt_1.5b_w4gptq_3090_r16.log
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/tmp/sharegpt.json', speed_bench_category=None, speed_bench_output_len=512, model='/models/rwkv7-1.5b-w4gptq', served_model_name=None, tokenizer='/models/rwkv7-1.5b-w4gptq', num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=16.0, use_trace_timestamps=False, max_concurrency=None, output_file='/tmp/sharegpt_1.5b_w4gptq_3090_r16.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://0.0.0.0:30000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/tmp/sharegpt.json', speed_bench_category=None, speed_bench_output_len=512, model='/models/rwkv7-1.5b-w4gptq', served_model_name=None, tokenizer='/models/rwkv7-1.5b-w4gptq', num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=16.0, use_trace_timestamps=False, max_concurrency=None, output_file='/tmp/sharegpt_1.5b_w4gptq_3090_r16.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 161035
#Output tokens: 98420
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 500/500 [00:54<00:00,  9.25it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    16.0      
Max request concurrency:                 not set   
Successful requests:                     500       
Benchmark duration (s):                  54.07     
Total input tokens:                      161035    
Total input text tokens:                 161035    
Total generated tokens:                  98420     
Total generated tokens (retokenized):    97399     
Request throughput (req/s):              9.25      
Input token throughput (tok/s):          2978.17   
Output token throughput (tok/s):         1820.17   
Peak output token throughput (tok/s):    7119.00   
Peak concurrent requests:                341       
Total token throughput (tok/s):          4798.34   
Concurrency:                             159.99    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   17301.66  
Median E2E Latency (ms):                 14795.73  
P90 E2E Latency (ms):                    36342.33  
P95 E2E Latency (ms):                    39790.77  
P99 E2E Latency (ms):                    47110.30  
---------------Time to First Token----------------
Mean TTFT (ms):                          454.50    
Median TTFT (ms):                        337.63    
P90 TTFT (ms):                           667.00    
P95 TTFT (ms):                           1266.75   
P99 TTFT (ms):                           2240.38   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          194.53    
Median TPOT (ms):                        125.34    
P90 TPOT (ms):                           452.51    
P95 TPOT (ms):                           529.88    
P99 TPOT (ms):                           859.78    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           86.08     
Median ITL (ms):                         31.92     
P90 ITL (ms):                            96.62     
P95 ITL (ms):                            184.05    
P99 ITL (ms):                            1736.79   
Max ITL (ms):                            3174.93   
==================================================